---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures.ForeignLink
source: html/30117f7a-b65c-cdb5-e6f0-e29a81051207.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures.ForeignLink Property

This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk.

## Syntax (C#)
```csharp
public static FailureDefinitionId ForeignLink { get; }
```